// '七年前端开发经验，两年管理经验',
// '实际主导开发过多平台项目（APP，PC，H5，小程序，快应用等），制定并规范团队协作模式',
// '前端技术栈均有尝试，擅长组件开发及构建优化',
// '负责腾讯优码项目的开发工作', '参与制定团队协作规范', '参与一些优码客户小程序、B端开发', '参与开源社区贡献'
//['负责聚美优品电商及增长FE团队(10+)的日常工作', '参与街电CRM开发，美点无人货架C/S开发等', '主导开发聚美等若干小程序/快应用及增长活动', '优化重构聚美底层若干库如jumei-sdk等']
//['负责高校校园移动APP相关的H5混合开发', '负责快速构建高质量移动APP/PC/微信页面', '根据业务需求设计合适的工程项目', '高度组件化、模块化思维，拥有各平台调试能力']
// ['负责各企业站静态页开发及简单交互', '负责网站后台管理页面开发', '负责百度竞价操作及seo优化', '同期工作之余提升自己原生JS的编码能力']
//专注并且热爱web开发，熟练掌握JavaScript、HTMl、CSS以及JavaScript框架来搭建web应用。了解原生JavaScript和JavaScript类库的使用。
// <li>熟知JS基本语法与知识，掌握最新JS语法与API以及TypeScript</li>
// <li>掌握网页重构所需的CSS、SCSS</li>
// <li>掌握前端流行框架React、Vue、Angular</li>
// <li>掌握chrome扩展开发及自动化控制</li>
// <li>用React开发大型复杂应用，熟知React原理与生态技术栈经验丰富</li>
// <li>掌握React调试、性能优化、同构、ReactNative等扩展技能</li>
// <li>主导和设计了团队多个大型项目的构建与迁移</li>
// <li>熟知Webpack原理，可以开发复杂的Webpack插件与loader</li>
//熟练掌握Vue.js/Angular.js/React.js 中一种前端框架，能独立开发常用组件；
//6、有良好的审美观和用户体验意识，良好的沟通能力与团队合作意识，有较强的学习能力，能够承担一定工作压力；
// 7、技术视野广阔，有主导前端技术方案设计的能力和经验，能够独立承担项目开发工作。
//- 从设计稿出发，快速实现可用的UI界面，同时考虑性能和可用性
// - 代码可靠，优雅，高性能且适配移动端
//1.负责web前端产品的开发，性能优化， 项目搭建；
// 2.参与产品的需求分析模块概要设计，模块详细设计，代码编写，单元测试等工作，对产品质量负责；
// 4.与后端工程师和测试经理进行技术沟通、交流，相互配合完成前端任务。
//3.熟悉JS以及主流JS框架，熟悉jQuery ,React ,Angular，vue等，熟悉SASS LESS Require JS grunt gulp 等工具；熟练掌握ES语法；
// 4.熟练使用Git等工具管理项目代码；
//熟练掌握HTML、CSS和JavaScript等前端技术
// 熟悉jQuery、Vue.js
// 熟悉常见的数据结构与算法、设计模式
/*熟练掌握html，css，js，可以脱离框架独立进行复杂项目的开发
*熟练掌握vue，react等前端架构以及相关的全家桶，有基于全家桶构建通用前端架构的经验
* 熟练掌握前端组件库的设计，有主导设计过公司内部前端组件库的经验
* 熟悉前端工程化，有前端架构工具的编写经验以及独立开发前端监控系统的经验
* */
//熟悉Web性能优化常用策略与原理


